#include"Menu.h"
//Определить класс с именем NОТЕ, содержащий следующие поля :
//● фамилия, имя;
//● номер телефона;
//● день рождения(массив из трех чисел).
//Определить методы доступа к этим полям и перегруженные операции
//извлечения и вставки для объектов типа NОТЕ.
//Заранее число объектов не известно.
//Написать программу, выполняющую следующие действия :
//● записи должны быть упорядочены по датам дней рождения;
//● вывод на экран информации о человеке, номер телефона которого
//введен с клавиатуры;
//● если такого нет, выдать на дисплей соответствующее сообщение.
//2. Файловые и строковые потоки
//С использованием файловых и строковых потоков написать программу,
//которая считывает текст из файла и выводит на экран только предложения,
//начинающиеся с тире, перед которым могут следовать только пробельные
//символы.

int main() {
	List list;
	try {
		return Menu(list);
	}
	catch (MyException& exception) {
		cout << "Exception occurred : " << exception.what() << "\n";
	}
	catch (exception& exception) {
		cout << "Some other exception occurred : " << exception.what() << "\n";
	}
}